# 3. Задан список слов, в которых встречается символ ‘_’ подчеркивание.
# Создать новый список, в котором символ подчеркивания в словах ‘_’
# заменить символом ‘ ‘ (пробел). l = [ "ab_cd_e", "abc", "a_b_c", "a__bc_d_", "__" ]

l = ["ab_cd_e", "abc", "a_b_c", "a__bc_d_", "__"]
new_list = []

for i in l:
    if '_' in i:
        a = i.replace('_', ' ')
        new_list.append(a)
    else:
        new_list.append(i)
print(f'Список, в котором знак "_" заменен на " ": {new_list}')
