# 2. Создайте словарь d = {'1': 0, ‘2’: 0, '3': 0} тремя способами.
# Выведите полученный словарь на экран.

d1 = dict.fromkeys(['1', '2', '3'], 0)
print(d1)
string = '1', '2', '3'
d2 = {i: 0 for i in string}
print(d2)
d3 = dict(zip(['1', '2', '3'], [0, 0, 0]))
print(d3)

