# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.

length = 6
V = length ** 3
S_side = 4 * length ** 2
print(V)
print(S_side)

# если вводим данные с клавиатуры, то:
length = int(input('Введите длину ребра: '))
V = length ** 3
S_side = 4 * length ** 2
print(V)
print(S_side)
