# 7. Создать список с числами от 1 до 50 используя генератор списков.

new_list = [i for i in range(1, 51)]
print(f'Список чисел от 1 до 50: {new_list}')
